prolog.org
#+SETUPFILE: setup.org
#+TITLE: Prolog

Knowledge databases that you might build with
[[./first-order-logic.org][first-order logic]] suffer from a
fatal problem: the logic is so sophisticated that finding answers
efficiently (or even finding an answer at all) becomes difficult or
impossible. First-order logic is so powerful that it can express almost
anything, including very tricky or paradoxical statements. It's not easy
to design algorithms to work with such systems.

Prolog is a programming language that allows us to "program" with
declarative knowledge. It puts limitations on the kinds of logical
statements we can write. These limitations are essential for allowing
Prolog programs to work efficiently and always provide an answer (or
determine there is no answer).

Because Prolog is a "Turing-complete" language, we can write any program
in Prolog. Of course, a program that is easy to write in Java or C++ will,
in all likelihood, be /very/ difficult to write in Prolog, although it
is possible. Prolog programs often feel like they're programs written in
"reverse," since they are written declaratively rather than procedurally.

(Note: Download and install
[[http://www.swi-prolog.org/download/stable][SWI Prolog]]; you may
also want [[http://sewiki.iai.uni-bonn.de/research/pdt/start][PDT]]
for Eclipse. The CSE Linux servers do not have Prolog; that is
ok, you should still submit from Linux but otherwise test your
code on your own machine. There is also the option to download a
[[http://portableapps.com/node/23749][portable version of SWI Prolog]]
to install on a USB key and use in any Windows machine you'd like,
such as the campus lab computers.)

* Some quick concepts and examples

There is probably no better way to introduce Prolog than to show some
examples. But first, a few important notes:

  - Prolog programs have two parts: a database (of facts and rules),
    and an interactive "query" tool; the database must be typed into a
    file.

  - Prolog databases are "consulted" (loaded), and then the query tool
    is used to "make queries" (ask questions) about the database.

  - How queries are answered is generally beyond the control of the
    programmer; Prolog uses a depth-first search to figure out how to
    answer queries; this is (generally) non-negotiable.

  - "Programs" written in Prolog are "executed" by performing queries.

Let's make a database by creating some facts:

#+BEGIN_SRC prolog
parent(tom, liz).
parent(bob, ann).
parent(bob, pat).
parent(pat, jim).

female(pam).
male(tom).
male(bob).
female(liz).
female(pat).
female(ann).
male(jim).
#+END_SRC

We type that into a file, maybe named ~family.pl~, and "consult" the
file in the query tool.

Now what? Well, we can ask questions:

#+BEGIN_SRC prolog
?- female(pam).
true.
#+END_SRC

Ok, it's true that ~pam~ is a female.

#+BEGIN_SRC prolog
?- parent(pat, ann).
false.
#+END_SRC

Right, ~pat~ is not ~ann~'s parent.

Now let's use variables. Variables always start with capital
letters. Objects (like ~pam~) must not.

#+BEGIN_SRC prolog
?- parent(X, ann).
X = bob.
#+END_SRC

So Prolog has found an assignment for ~X~ that makes the statement
true. We call ~parent~ a predicate (a 2-ary predicate because it
accepts two inputs), and we always write queries by first stating a
predicate.

Let's ask, "Who are all the parents?"

#+BEGIN_SRC prolog
?- parent(P, C).
P = tom,
C = liz ;
P = bob,
C = ann ;
P = bob,
C = pat ;
P = pat,
C = jim.
#+END_SRC

(I typed the ~;~ --- we type that to get the next answer.)

If I don't actually care who the children are, I can replace ~C~ with
~_~ like so:

#+BEGIN_SRC prolog
?- parent(P, _).
P = tom ;
P = bob ;
P = bob ;
P = pat.
#+END_SRC

We get ~bob~ twice because he's the parent of two people.

Now let's ask, "Who are the female parents?"

#+BEGIN_SRC prolog
?- parent(P, _), female(P).
P = pat.
#+END_SRC

The comma means "AND." So the query requires that ~P~ is a parent and
a female.

