prolog.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Prolog</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Prolog"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-16 13:58:49 EST"/>
<meta name="author" content="Joshua Eckroth"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>

<div id="preamble">
<a href="index.html">Home</a> &nbsp; &nbsp;
          <!-- Plupper Button -->
          <div id="plupperButton" style="display: inline;"></div>
          <!-- End of Plupper Button Code -->

</div>

<div id="content">
<h1 class="title">Prolog</h1>

<p>Knowledge databases that you might build with
<a href="./first-order-logic.html">first-order logic</a> suffer from a
fatal problem: the logic is so sophisticated that finding answers
efficiently (or even finding an answer at all) becomes difficult or
impossible. First-order logic is so powerful that it can express almost
anything, including very tricky or paradoxical statements. It&rsquo;s not easy
to design algorithms to work with such systems.
</p>
<p>
Prolog is a programming language that allows us to &ldquo;program&rdquo; with
declarative knowledge. It puts limitations on the kinds of logical
statements we can write. These limitations are essential for allowing
Prolog programs to work efficiently and always provide an answer (or
determine there is no answer).
</p>
<p>
Because Prolog is a &ldquo;Turing-complete&rdquo; language, we can write any program
in Prolog. Of course, a program that is easy to write in Java or C++ will,
in all likelihood, be <i>very</i> difficult to write in Prolog, although it
is possible. Prolog programs often feel like they&rsquo;re programs written in
&ldquo;reverse,&rdquo; since they are written declaratively rather than procedurally.
</p>
<p>
(Note: Download and install
<a href="http://www.swi-prolog.org/download/stable">SWI Prolog</a>; you may
also want <a href="http://sewiki.iai.uni-bonn.de/research/pdt/start">PDT</a>
for Eclipse. The CSE Linux servers do not have Prolog; that is
ok, you should still submit from Linux but otherwise test your
code on your own machine. There is also the option to download a
<a href="http://portableapps.com/node/23749">portable version of SWI Prolog</a>
to install on a USB key and use in any Windows machine you&rsquo;d like,
such as the campus lab computers.)
</p>

<div id="table-of-contents">
<h2>TOC</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Some quick concepts and examples</a></li>
<li><a href="#sec-2">Defining complex predicates (rules)</a></li>
<li><a href="#sec-3">Negation as failure</a></li>
<li><a href="#sec-4">Lists in Prolog</a></li>
<li><a href="#sec-5">Prolog for databases</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Some quick concepts and examples</h2>
<div class="outline-text-2" id="text-1">


<p>
There is probably no better way to introduce Prolog than to show some
examples. But first, a few important notes:
</p>
<ul>
<li>Prolog programs have two parts: a database (of facts and rules),
    and an interactive &ldquo;query&rdquo; tool; the database must be typed into a
    file.

</li>
<li>Prolog databases are &ldquo;consulted&rdquo; (loaded), and then the query tool
    is used to &ldquo;make queries&rdquo; (ask questions) about the database.

</li>
<li>How queries are answered is generally beyond the control of the
    programmer; Prolog uses a depth-first search to figure out how to
    answer queries; this is (generally) non-negotiable.

</li>
<li>&ldquo;Programs&rdquo; written in Prolog are &ldquo;executed&rdquo; by performing queries.
</li>
</ul>


<p>
Let&rsquo;s make a database by creating some facts:
</p>



<pre class="src src-prolog"><span style="color: #0000ff;">parent</span>(tom, liz).
<span style="color: #0000ff;">parent</span>(bob, ann).
<span style="color: #0000ff;">parent</span>(bob, pat).
<span style="color: #0000ff;">parent</span>(pat, jim).

<span style="color: #0000ff;">female</span>(pam).
<span style="color: #0000ff;">male</span>(tom).
<span style="color: #0000ff;">male</span>(bob).
<span style="color: #0000ff;">female</span>(liz).
<span style="color: #0000ff;">female</span>(pat).
<span style="color: #0000ff;">female</span>(ann).
<span style="color: #0000ff;">male</span>(jim).
</pre>


<p>
We type that into a file, maybe named <code>family.pl</code>, and &ldquo;consult&rdquo; the
file in the query tool.
</p>
<p>
Now what? Well, we can ask questions:
</p>



<pre class="src src-prolog">?- female(pam).
true.
</pre>


<p>
Ok, it&rsquo;s true that <code>pam</code> is a female.
</p>



<pre class="src src-prolog">?- parent(pat, ann).
false.
</pre>


<p>
Right, <code>pat</code> is not <code>ann</code>&rsquo;s parent.
</p>
<p>
Now let&rsquo;s use variables. Variables always start with capital
letters. Objects (like <code>pam</code>) must not.
</p>



<pre class="src src-prolog">?- parent(<span style="color: #a0522d;">X</span>, ann).
<span style="color: #a0522d;">X</span> = bob.
</pre>


<p>
So Prolog has found an assignment for <code>X</code> that makes the statement
true. We call <code>parent</code> a predicate (a 2-ary predicate because it
accepts two inputs), and we always write queries by first stating a
predicate.
</p>
<p>
Let&rsquo;s ask, &ldquo;Who are all the parents?&rdquo;
</p>



<pre class="src src-prolog">?- parent(<span style="color: #a0522d;">P</span>, <span style="color: #a0522d;">C</span>).
<span style="color: #a0522d;">P</span> = tom,
<span style="color: #a0522d;">C</span> = liz <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">P</span> = bob,
<span style="color: #a0522d;">C</span> = ann <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">P</span> = bob,
<span style="color: #a0522d;">C</span> = pat <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">P</span> = pat,
<span style="color: #a0522d;">C</span> = jim.
</pre>


<p>
(I typed the <code>;</code> &mdash; we type that to get the next answer.)
</p>
<p>
If I don&rsquo;t actually care who the children are, I can replace <code>C</code> with
<code>_</code> like so:
</p>



<pre class="src src-prolog">?- parent(<span style="color: #a0522d;">P</span>, <span style="color: #a0522d;">_</span>).
<span style="color: #a0522d;">P</span> = tom <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">P</span> = bob <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">P</span> = bob <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">P</span> = pat.
</pre>


<p>
We get <code>bob</code> twice because he&rsquo;s the parent of two people.
</p>
<p>
Now let&rsquo;s ask, &ldquo;Who are the female parents?&rdquo;
</p>



<pre class="src src-prolog">?- parent(<span style="color: #a0522d;">P</span>, <span style="color: #a0522d;">_</span>), female(<span style="color: #a0522d;">P</span>).
<span style="color: #a0522d;">P</span> = pat.
</pre>


<p>
The comma means &ldquo;AND.&rdquo; So the query requires that <code>P</code> is a parent and
a female.
</p>
</div>

</div>
