prolog.org
* Defining complex predicates (rules)

The predicates shown above (~parent~, ~male~, and ~female~) are always
true. They are called "facts."

A "rule," instead, is true only when some conditions are met. These
conditions look like the last query above: they typically require
several predicates to be true. The last query above is basically what
defines a "mother." Let's make a rule (in our database file,
~family.pl~):

#+BEGIN_SRC prolog
mother(X) :- parent(X, _), female(X).
#+END_SRC prolog

"Consult" the database again, and run these queries:

#+BEGIN_SRC prolog
?- mother(pat).
true.

?- mother(jim).
false.

?- mother(X).
X = pat.
#+END_SRC

Now for fathers. In the database, we add:

#+BEGIN_SRC prolog
father(X) :- parent(X, _), male(X).
#+END_SRC prolog

And here is a query:

#+BEGIN_SRC prolog
?- father(X).
X = tom ;
X = bob ;
X = bob ;
false.
#+END_SRC

Why the ~false~ at the end? The ~;~ basically means "throw away the
answer you just gave, and try again." Prolog finds a parent ~X~
(probably ~pat~), but then that ~X~ does not satisfy the second part
of the ~father~ rule, which is written ~male(X)~, so the answer is
~false~ for that ~X~.

Notice that ~pat~ is the parent of ~jim~ and ~bob~ is the parent of
~pat~. That makes ~bob~ a grandparent. Let's write a query to that
effect:

#+BEGIN_SRC prolog
?- parent(X, Y), parent(Y, _).
X = bob,
Y = pat.
#+END_SRC

See? ~bob~ is a grandparent. Let's make a rule:

#+BEGIN_SRC prolog
grandparent(X) :- parent(X, Y), parent(Y, _).
#+END_SRC

And here are two queries:

#+BEGIN_SRC prolog
?- grandparent(bob).
true.

?- grandparent(jim).
false.
#+END_SRC

Let's try defining the sister relationship:

#+BEGIN_SRC prolog
sister(X, Y) :- parent(Z, X), parent(Z, Y), female(X), female(Y).
#+END_SRC

And some queries:

#+BEGIN_SRC prolog
?- sister(ann, pat).
true.

?- sister(bob, pat).
false.

?- sister(X, Y).
X = Y, Y = liz ;
X = Y, Y = ann ;
X = ann,
Y = pat ;
X = pat,
Y = ann ;
X = Y, Y = pat ;
false.
#+END_SRC

What does ~X = Y, Y = liz~ mean? It means ~liz~ is, apparently, her
own sister:

#+BEGIN_SRC prolog
?- sister(liz, liz).
true.
#+END_SRC

Let's prevent that by adding another clause to the ~sister~ predicate
(~\=~ means "not equal"):

#+BEGIN_SRC prolog
sister(X, Y) :- parent(Z, X), parent(Z, Y), female(X), female(Y), X \= Y.
#+END_SRC

Now, we get the correct behavior:

#+BEGIN_SRC prolog
?- sister(liz, liz).
false.

?- sister(X, Y).
X = ann,
Y = pat ;
X = pat,
Y = ann ;
false.
#+END_SRC

These rules are essentially the following logical statements:

$$(\forall x)(\exists y)((Parent(x, y) \wedge Female(x)) \rightarrow
Mother(x))$$

$$(\forall x)(\exists y)((Parent(x, y) \wedge Male(x)) \rightarrow
Father(x))$$

$$(\forall x)(\exists y)(\exists z)((Parent(x, y) \wedge Parent(y, z))
\rightarrow Grandparent(x))$$

$$(\forall x)(\forall y)(\exists z)((Parent(z, x) \wedge Parent(z, y)
\wedge Female(x) \wedge Female(y) \wedge x \neq y)
\rightarrow Sister(x, y))$$

Notice how they all have the same form. Essentially, the variables in
the rule (~X~ or both ~X~ and ~Y~ in each of these cases) have a
$\forall$ in front (because the rule is true for all variables ~X~ or
~X~ and ~Y~, should certain conditions hold), and the variables inside
the rule have $\exists$ in front because you only need to find one
value for each variable to make the rule true. Notice we have
$\rightarrow$ not $\leftrightarrow$ because there may be more than one
way to satisfy a rule. For example,

#+BEGIN_SRC prolog
engineer(X) :- mechanical_engineer(X).

engineer(X) :- chemical_engineer(X).

engineer(X) :- electrical_engineer(X).

% etc. etc.
#+END_SRC

This is how we do "or" in Prolog: we make new rules. In each rule, we
use commas for "and," but (generally) do not write "or" inside a rule.

