prolog.html

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Defining complex predicates (rules)</h2>
<div class="outline-text-2" id="text-2">


<p>
The predicates shown above (<code>parent</code>, <code>male</code>, and <code>female</code>) are always
true. They are called &ldquo;facts.&rdquo;
</p>
<p>
A &ldquo;rule,&rdquo; instead, is true only when some conditions are met. These
conditions look like the last query above: they typically require
several predicates to be true. The last query above is basically what
defines a &ldquo;mother.&rdquo; Let&rsquo;s make a rule (in our database file,
<code>family.pl</code>):
</p>



<pre class="src src-prolog"><span style="color: #0000ff;">mother</span>(<span style="color: #a0522d;">X</span>) :- parent(<span style="color: #a0522d;">X</span>, <span style="color: #a0522d;">_</span>), female(<span style="color: #a0522d;">X</span>).
</pre>


<p>
&ldquo;Consult&rdquo; the database again, and run these queries:
</p>



<pre class="src src-prolog">?- mother(pat).
true.

?- mother(jim).
false.

?- mother(<span style="color: #a0522d;">X</span>).
<span style="color: #a0522d;">X</span> = pat.
</pre>


<p>
Now for fathers. In the database, we add:
</p>



<pre class="src src-prolog"><span style="color: #0000ff;">father</span>(<span style="color: #a0522d;">X</span>) :- parent(<span style="color: #a0522d;">X</span>, <span style="color: #a0522d;">_</span>), male(<span style="color: #a0522d;">X</span>).
</pre>


<p>
And here is a query:
</p>



<pre class="src src-prolog">?- father(<span style="color: #a0522d;">X</span>).
<span style="color: #a0522d;">X</span> = tom <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = bob <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = bob <span style="color: #a020f0;">;</span>
false.
</pre>


<p>
Why the <code>false</code> at the end? The <code>;</code> basically means &ldquo;throw away the
answer you just gave, and try again.&rdquo; Prolog finds a parent <code>X</code>
(probably <code>pat</code>), but then that <code>X</code> does not satisfy the second part
of the <code>father</code> rule, which is written <code>male(X)</code>, so the answer is
<code>false</code> for that <code>X</code>.
</p>
<p>
Notice that <code>pat</code> is the parent of <code>jim</code> and <code>bob</code> is the parent of
<code>pat</code>. That makes <code>bob</code> a grandparent. Let&rsquo;s write a query to that
effect:
</p>



<pre class="src src-prolog">?- parent(<span style="color: #a0522d;">X</span>, <span style="color: #a0522d;">Y</span>), parent(<span style="color: #a0522d;">Y</span>, <span style="color: #a0522d;">_</span>).
<span style="color: #a0522d;">X</span> = bob,
<span style="color: #a0522d;">Y</span> = pat.
</pre>


<p>
See? <code>bob</code> is a grandparent. Let&rsquo;s make a rule:
</p>



<pre class="src src-prolog"><span style="color: #0000ff;">grandparent</span>(<span style="color: #a0522d;">X</span>) :- parent(<span style="color: #a0522d;">X</span>, <span style="color: #a0522d;">Y</span>), parent(<span style="color: #a0522d;">Y</span>, <span style="color: #a0522d;">_</span>).
</pre>


<p>
And here are two queries:
</p>



<pre class="src src-prolog">?- grandparent(bob).
true.

?- grandparent(jim).
false.
</pre>


<p>
Let&rsquo;s try defining the sister relationship:
</p>



<pre class="src src-prolog"><span style="color: #0000ff;">sister</span>(<span style="color: #a0522d;">X</span>, <span style="color: #a0522d;">Y</span>) :- parent(<span style="color: #a0522d;">Z</span>, <span style="color: #a0522d;">X</span>), parent(<span style="color: #a0522d;">Z</span>, <span style="color: #a0522d;">Y</span>), female(<span style="color: #a0522d;">X</span>), female(<span style="color: #a0522d;">Y</span>).
</pre>


<p>
And some queries:
</p>



<pre class="src src-prolog">?- sister(ann, pat).
true.

?- sister(bob, pat).
false.

?- sister(<span style="color: #a0522d;">X</span>, <span style="color: #a0522d;">Y</span>).
<span style="color: #a0522d;">X</span> = <span style="color: #a0522d;">Y</span>, <span style="color: #a0522d;">Y</span> = liz <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = <span style="color: #a0522d;">Y</span>, <span style="color: #a0522d;">Y</span> = ann <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = ann,
<span style="color: #a0522d;">Y</span> = pat <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = pat,
<span style="color: #a0522d;">Y</span> = ann <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = <span style="color: #a0522d;">Y</span>, <span style="color: #a0522d;">Y</span> = pat <span style="color: #a020f0;">;</span>
false.
</pre>


<p>
What does <code>X = Y, Y = liz</code> mean? It means <code>liz</code> is, apparently, her
own sister:
</p>



<pre class="src src-prolog">?- sister(liz, liz).
true.
</pre>


<p>
Let&rsquo;s prevent that by adding another clause to the <code>sister</code> predicate
(<code>\=</code> means &ldquo;not equal&rdquo;):
</p>



<pre class="src src-prolog"><span style="color: #0000ff;">sister</span>(<span style="color: #a0522d;">X</span>, <span style="color: #a0522d;">Y</span>) :- parent(<span style="color: #a0522d;">Z</span>, <span style="color: #a0522d;">X</span>), parent(<span style="color: #a0522d;">Z</span>, <span style="color: #a0522d;">Y</span>), female(<span style="color: #a0522d;">X</span>), female(<span style="color: #a0522d;">Y</span>), <span style="color: #a0522d;">X</span> \= <span style="color: #a0522d;">Y</span>.
</pre>


<p>
Now, we get the correct behavior:
</p>



<pre class="src src-prolog">?- sister(liz, liz).
false.

?- sister(<span style="color: #a0522d;">X</span>, <span style="color: #a0522d;">Y</span>).
<span style="color: #a0522d;">X</span> = ann,
<span style="color: #a0522d;">Y</span> = pat <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = pat,
<span style="color: #a0522d;">Y</span> = ann <span style="color: #a020f0;">;</span>
false.
</pre>


<p>
These rules are essentially the following logical statements:
</p>


$$(\forall x)(\exists y)((Parent(x, y) \wedge Female(x)) \rightarrow
Mother(x))$$

$$(\forall x)(\exists y)((Parent(x, y) \wedge Male(x)) \rightarrow
Father(x))$$

$$(\forall x)(\exists y)(\exists z)((Parent(x, y) \wedge Parent(y, z))
\rightarrow Grandparent(x))$$

$$(\forall x)(\forall y)(\exists z)((Parent(z, x) \wedge Parent(z, y)
\wedge Female(x) \wedge Female(y) \wedge x \neq y)
\rightarrow Sister(x, y))$$

<p>
Notice how they all have the same form. Essentially, the variables in
the rule (<code>X</code> or both <code>X</code> and <code>Y</code> in each of these cases) have a
\(\forall\) in front (because the rule is true for all variables <code>X</code> or
<code>X</code> and <code>Y</code>, should certain conditions hold), and the variables inside
the rule have \(\exists\) in front because you only need to find one
value for each variable to make the rule true. Notice we have
\(\rightarrow\) not \(\leftrightarrow\) because there may be more than one
way to satisfy a rule. For example,
</p>



<pre class="src src-prolog"><span style="color: #0000ff;">engineer</span>(<span style="color: #a0522d;">X</span>) :- mechanical_engineer(<span style="color: #a0522d;">X</span>).

<span style="color: #0000ff;">engineer</span>(<span style="color: #a0522d;">X</span>) :- chemical_engineer(<span style="color: #a0522d;">X</span>).

<span style="color: #0000ff;">engineer</span>(<span style="color: #a0522d;">X</span>) :- electrical_engineer(<span style="color: #a0522d;">X</span>).

<span style="color: #b22222;">% </span><span style="color: #b22222;">etc. etc.</span>
</pre>


<p>
This is how we do &ldquo;or&rdquo; in Prolog: we make new rules. In each rule, we
use commas for &ldquo;and,&rdquo; but (generally) do not write &ldquo;or&rdquo; inside a rule.
</p>
</div>

</div>
