prolog.org
* Negation as failure

Negation is a little bit funny in Prolog. That's because negation is a
little bit funny in life. How does anyone prove a negative statement?
"I never read that book" --- how can that be proved?

Let's say we want a predicate like "this person is not a father."
Well, we know how to figure out who /is/ a father: we have the
~father~ rule. How can we define a "is not a father" rule?

The first thing to note is Prolog does not allow us to use negatives
in facts. We cannot write "not father(jim)."

Instead, to prove a negative in Prolog, we use a little trick: we
assume everything stated in the database is /everything that exists/
(this is the "closed-world assumption"). Anything not stated in the
database does not exist. So, we can "prove" that ~jim~ is not a father
by /failing/ to prove that ~jim~ is a father (with our ~father~ rule).

#+BEGIN_SRC prolog
not_a_father(X) :- \+father(X).
#+END_SRC

Some queries:

#+BEGIN_SRC prolog
?- not_a_father(bob).
false.

?- not_a_father(jim).
true.
#+END_SRC

The ~\+~ is the "negation operator." The idea is that ~\+father(X)~ is
true whenever ~father(X)~ fails to be proved (recall that Prolog may
search /every possibility/ in order to prove something; thus, negation
can be computationally expensive).

We cannot use ~\+~ on the left-side of a rule or written as a fact
because it makes no sense to say, "this will fail to be proven
always." Only positive statements can be on the left of a rule or
written as a fact.

This connection between "failing to prove" and "negation" is called
"negation as failure." Negation as failure means, "proving the
negation of something is equivalent to failing to prove that
something" and depends on a closed-world assumption.

#+BEGIN_QUOTE
*negation-as-failure* /Also/ *negation-by-failure* /n./ /Logic
programming/ *1* The reasonable assumption that /P/ is false if one
has failed to prove that /P/ is true. *2* The unreasonable assumption
that /P/ is false if others have failed to prove that /P/ is true. *3*
/Drugs/ The ineffectiveness of the "Just Say No!" campaign. --- /The
computer contradictionary/
#+END_QUOTE

* Lists in Prolog

Besides atoms (~ann~, ~pat~, ~bob~, etc.) we can create lists. Let's
make a simple predicate that says whether or not something is at the
head (front) of a list:

#+BEGIN_SRC prolog
head(X, [X|_]).
#+END_SRC

The code ~[X|_]~ means there is a list that starts with ~X~ and the
rest (after the ~|~) I don't care about (hence the ~_~). Here are some
uses of this predicate:

#+BEGIN_SRC prolog
?- head(a, [a, b, c]).
true.

?- head(X, [a, b, c]).
X = a.

?- head(a, X).
X = [a|_G228].
#+END_SRC

The ~_G228~ is a variable that Prolog created to represent the rest of
the list; it has made no commitment about what ~_G228~ is, hence it
can only describe it as variable ~_G228~.

Predicates can be recursive, which is exactly what is needed for the
membership predicate:

#+BEGIN_SRC prolog
% X is a member of a list if the list only has the element X in it
member(X, [X]).

% X is a member of a list if the list starts with X
% (technically, the above statement is not needed; this
% statement suffices)
member(X, [X|_]).

% Finally, X is a member of a list if it's a member of
% the tail of the list
member(X, [_|Tail]) :- member(X, Tail).
#+END_SRC

Example usage (I'm typing ~.~ after some responses because I don't
want other possible answers):

#+BEGIN_SRC prolog
?- member(a, [a]).
true .

?- member(a, [a, b, c]).
true .

?- member(X, [a, b, c]).
X = a ;
X = b ;
X = c .

?- member(a, X).
X = [a|_G231] ;
X = [_G230, a|_G234] ;
X = [_G230, _G233, a|_G237] ;
X = [_G230, _G233, _G236, a|_G240] ;
X = [_G230, _G233, _G236, _G239, a|_G243] .
#+END_SRC

In that last case, Prolog is /generating/ lists that have ~a~ as a
member somewhere. Pretty weird, huh? It's finding some way to make the
predicate true.

