prolog.html

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Negation as failure</h2>
<div class="outline-text-2" id="text-3">


<p>
Negation is a little bit funny in Prolog. That&rsquo;s because negation is a
little bit funny in life. How does anyone prove a negative statement?
&ldquo;I never read that book&rdquo; &mdash; how can that be proved?
</p>
<p>
Let&rsquo;s say we want a predicate like &ldquo;this person is not a father.&rdquo;
Well, we know how to figure out who <i>is</i> a father: we have the
<code>father</code> rule. How can we define a &ldquo;is not a father&rdquo; rule?
</p>
<p>
The first thing to note is Prolog does not allow us to use negatives
in facts. We cannot write &ldquo;not father(jim).&rdquo;
</p>
<p>
Instead, to prove a negative in Prolog, we use a little trick: we
assume everything stated in the database is <i>everything that exists</i>
(this is the &ldquo;closed-world assumption&rdquo;). Anything not stated in the
database does not exist. So, we can &ldquo;prove&rdquo; that <code>jim</code> is not a father
by <i>failing</i> to prove that <code>jim</code> is a father (with our <code>father</code> rule).
</p>



<pre class="src src-prolog"><span style="color: #0000ff;">not_a_father</span>(<span style="color: #a0522d;">X</span>) :- \+father(<span style="color: #a0522d;">X</span>).
</pre>


<p>
Some queries:
</p>



<pre class="src src-prolog">?- not_a_father(bob).
false.

?- not_a_father(jim).
true.
</pre>


<p>
The <code>\+</code> is the &ldquo;negation operator.&rdquo; The idea is that <code>\+father(X)</code> is
true whenever <code>father(X)</code> fails to be proved (recall that Prolog may
search <i>every possibility</i> in order to prove something; thus, negation
can be computationally expensive).
</p>
<p>
We cannot use <code>\+</code> on the left-side of a rule or written as a fact
because it makes no sense to say, &ldquo;this will fail to be proven
always.&rdquo; Only positive statements can be on the left of a rule or
written as a fact.
</p>
<p>
This connection between &ldquo;failing to prove&rdquo; and &ldquo;negation&rdquo; is called
&ldquo;negation as failure.&rdquo; Negation as failure means, &ldquo;proving the
negation of something is equivalent to failing to prove that
something&rdquo; and depends on a closed-world assumption.
</p>
<blockquote>

<p><b>negation-as-failure</b> <i>Also</i> <b>negation-by-failure</b> <i>n.</i> <i>Logic programming</i> <b>1</b> The reasonable assumption that <i>P</i> is false if one
has failed to prove that <i>P</i> is true. <b>2</b> The unreasonable assumption
that <i>P</i> is false if others have failed to prove that <i>P</i> is true. <b>3</b>
<i>Drugs</i> The ineffectiveness of the &ldquo;Just Say No!&rdquo; campaign. &mdash; <i>The computer contradictionary</i>
</p>
</blockquote>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Lists in Prolog</h2>
<div class="outline-text-2" id="text-4">


<p>
Besides atoms (<code>ann</code>, <code>pat</code>, <code>bob</code>, etc.) we can create lists. Let&rsquo;s
make a simple predicate that says whether or not something is at the
head (front) of a list:
</p>



<pre class="src src-prolog"><span style="color: #0000ff;">head</span>(<span style="color: #a0522d;">X</span>, <span style="color: #a020f0;">[</span><span style="color: #a0522d;">X</span><span style="color: #a020f0;">|</span><span style="color: #a0522d;">_</span><span style="color: #a020f0;">]</span>).
</pre>


<p>
The code <code>[X|_]</code> means there is a list that starts with <code>X</code> and the
rest (after the <code>|</code>) I don&rsquo;t care about (hence the <code>_</code>). Here are some
uses of this predicate:
</p>



<pre class="src src-prolog">?- head(a, <span style="color: #a020f0;">[</span>a, b, c<span style="color: #a020f0;">]</span>).
true.

?- head(<span style="color: #a0522d;">X</span>, <span style="color: #a020f0;">[</span>a, b, c<span style="color: #a020f0;">]</span>).
<span style="color: #a0522d;">X</span> = a.

?- head(a, <span style="color: #a0522d;">X</span>).
<span style="color: #a0522d;">X</span> = <span style="color: #a020f0;">[</span>a<span style="color: #a020f0;">|</span><span style="color: #a0522d;">_G228</span><span style="color: #a020f0;">]</span>.
</pre>


<p>
The <code>_G228</code> is a variable that Prolog created to represent the rest of
the list; it has made no commitment about what <code>_G228</code> is, hence it
can only describe it as variable <code>_G228</code>.
</p>
<p>
Predicates can be recursive, which is exactly what is needed for the
membership predicate:
</p>



<pre class="src src-prolog"><span style="color: #b22222;">% </span><span style="color: #b22222;">X is a member of a list if the list only has the element X in it</span>
<span style="color: #0000ff;">member</span>(<span style="color: #a0522d;">X</span>, <span style="color: #a020f0;">[</span><span style="color: #a0522d;">X</span><span style="color: #a020f0;">]</span>).

<span style="color: #b22222;">% </span><span style="color: #b22222;">X is a member of a list if the list starts with X</span>
<span style="color: #b22222;">% </span><span style="color: #b22222;">(technically, the above statement is not needed; this</span>
<span style="color: #b22222;">% </span><span style="color: #b22222;">statement suffices)</span>
<span style="color: #0000ff;">member</span>(<span style="color: #a0522d;">X</span>, <span style="color: #a020f0;">[</span><span style="color: #a0522d;">X</span><span style="color: #a020f0;">|</span><span style="color: #a0522d;">_</span><span style="color: #a020f0;">]</span>).

<span style="color: #b22222;">% </span><span style="color: #b22222;">Finally, X is a member of a list if it's a member of</span>
<span style="color: #b22222;">% </span><span style="color: #b22222;">the tail of the list</span>
<span style="color: #0000ff;">member</span>(<span style="color: #a0522d;">X</span>, <span style="color: #a020f0;">[</span><span style="color: #a0522d;">_</span><span style="color: #a020f0;">|</span><span style="color: #a0522d;">Tail</span><span style="color: #a020f0;">]</span>) :- member(<span style="color: #a0522d;">X</span>, <span style="color: #a0522d;">Tail</span>).
</pre>


<p>
Example usage (I&rsquo;m typing <code>.</code> after some responses because I don&rsquo;t
want other possible answers):
</p>



<pre class="src src-prolog">?- member(a, <span style="color: #a020f0;">[</span>a<span style="color: #a020f0;">]</span>).
true .

?- member(a, <span style="color: #a020f0;">[</span>a, b, c<span style="color: #a020f0;">]</span>).
true .

?- member(<span style="color: #a0522d;">X</span>, <span style="color: #a020f0;">[</span>a, b, c<span style="color: #a020f0;">]</span>).
<span style="color: #a0522d;">X</span> = a <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = b <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = c .

?- member(a, <span style="color: #a0522d;">X</span>).
<span style="color: #a0522d;">X</span> = <span style="color: #a020f0;">[</span>a<span style="color: #a020f0;">|</span><span style="color: #a0522d;">_G231</span><span style="color: #a020f0;">]</span> <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = <span style="color: #a020f0;">[</span><span style="color: #a0522d;">_G230</span>, a<span style="color: #a020f0;">|</span><span style="color: #a0522d;">_G234</span><span style="color: #a020f0;">]</span> <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = <span style="color: #a020f0;">[</span><span style="color: #a0522d;">_G230</span>, <span style="color: #a0522d;">_G233</span>, a<span style="color: #a020f0;">|</span><span style="color: #a0522d;">_G237</span><span style="color: #a020f0;">]</span> <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = <span style="color: #a020f0;">[</span><span style="color: #a0522d;">_G230</span>, <span style="color: #a0522d;">_G233</span>, <span style="color: #a0522d;">_G236</span>, a<span style="color: #a020f0;">|</span><span style="color: #a0522d;">_G240</span><span style="color: #a020f0;">]</span> <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = <span style="color: #a020f0;">[</span><span style="color: #a0522d;">_G230</span>, <span style="color: #a0522d;">_G233</span>, <span style="color: #a0522d;">_G236</span>, <span style="color: #a0522d;">_G239</span>, a<span style="color: #a020f0;">|</span><span style="color: #a0522d;">_G243</span><span style="color: #a020f0;">]</span> .
</pre>


<p>
In that last case, Prolog is <i>generating</i> lists that have <code>a</code> as a
member somewhere. Pretty weird, huh? It&rsquo;s finding some way to make the
predicate true.
</p>
</div>

</div>
