prolog.org
* Prolog for databases

Now we'll investigate using Prolog for representing and answering
queries about data. Let's build a database of people and families. We
want to say that certain people are born on certain dates, have jobs
with particular incomes, are married, have children, etc.

We'll start with a predicate, ~family~, that says a family is made up
of an ID (a number), two parents, and zero-or-more children (a
list). Each person has a first name and last name, birth date, and is
either unemployed or has a job with a particular salary.

#+BEGIN_SRC prolog
family(10392,
       person(tom, fox, born(7, may, 1960), works(cnn, 152000)),
       person(ann, fox, born(19, april, 1961), works(nyu, 65000)),
       % here are the children...
       [person(pat, fox, born(5, october, 1983), unemployed),
        person(jim, fox, born(1, june, 1986), unemployed),
        person(amy, fox, born(17, december, 1990), unemployed)]).

family(38463, 
       person(susan, rothchild, born(13, september, 1972), works(osu, 75000)),
       person(jess, rothchild, born(20, july, 1975), works(nationwide, 123500)),
       % here are the children...
       [person(ace, rothchild, born(2, january, 2010), unemployed)]).
#+END_SRC

There are two families. Note that ~person~ is not a predicate, it's
just a way of writing data. We have no way of asking ~person(X, Y,
...)~ because it's not a predicate. To access person data, we have to
use the ~family~ predicate. Here are some examples:

#+BEGIN_SRC prolog
?- family(38463, X, Y, Z).
X = person(susan, rothchild, born(13, september, 1972), works(osu, 75000)),
Y = person(jess, rothchild, born(20, july, 1975), works(nationwide, 123500)),
Z = [person(ace, rothchild, born(2, january, 2010), unemployed)].

?- family(38463, person(FirstName, LastName, _, _), _, _).
FirstName = susan,
LastName = rothchild.

?- family(ID, person(susan, rothchild, _, _), _, _).
ID = 38463.
#+END_SRC

Using this ~family~ predicate, we just put a variable in a location
that we want to retrieve information about (such as family ID or a
first name / last name of a person), and put ~_~ for all the slots we
don't care about.

Now let's make it a little more interesting. Here is a ~married~
predicate that says if two people are married:

#+BEGIN_SRC prolog
married(FirstName1, LastName1, FirstName2, LastName2) :-
    family(_, person(FirstName1, LastName1, _, _),
           person(FirstName2, LastName2, _, _), _).

married(FirstName1, LastName1, FirstName2, LastName2) :-
    family(_, person(FirstName2, LastName2, _, _),
           person(FirstName1, LastName1, _, _), _).
#+END_SRC

And its use:

#+BEGIN_SRC prolog
?- married(tom, fox, ann, fox).
true .

?- married(X, Y, ann, fox).
X = tom,
Y = fox .

?- married(X, Y, A, B).
X = tom,
Y = fox,
A = ann,
B = fox ;
X = susan,
Y = rothchild,
A = jess,
B = rothchild .
#+END_SRC

Here is a predicate for calculating household income. We can calculate
(simple math) using the ~is~ keyword:

#+BEGIN_SRC prolog
householdIncome(ID, Income) :-
    family(ID, person(_, _, _, works(_, Income1)),
           person(_, _, _, works(_, Income2)), _),
    Income is Income1 + Income2.
#+END_SRC

And its use:

#+BEGIN_SRC prolog
?- householdIncome(38463, X).
X = 198500.

?- householdIncome(X, 198500).
X = 38463.

?- householdIncome(X, 999).
false.

?- householdIncome(X, Y).
X = 10392,
Y = 217000 ;
X = 38463,
Y = 198500.
#+END_SRC

To facilitate further queries, we'll create an ~exists~ predicate that
we can use to retrieve details about a person. It just pulls person
information out of the various places it may appear in a ~family~
fact.

#+BEGIN_SRC prolog
exists(Person) :- family(_, Person, _, _).
exists(Person) :- family(_, _, Person, _).
exists(Person) :- family(_, _, _, Children), member(Person, Children).
#+END_SRC

We can use it like so:

#+BEGIN_SRC prolog
?- exists(X).
X = person(tom, fox, born(7, may, 1960), works(cnn, 152000)) ;
X = person(susan, rothchild, born(13, september, 1972), works(osu, 75000)) ;
X = person(ann, fox, born(19, april, 1961), works(nyu, 65000)) ;
X = person(jess, rothchild, born(20, july, 1975), works(nationwide, 123500)) ;
X = person(pat, fox, born(5, october, 1983), unemployed) ;
X = person(jim, fox, born(1, june, 1986), unemployed) ;
X = person(amy, fox, born(17, december, 1990), unemployed) ;
X = person(ace, rothchild, born(2, january, 2010), unemployed).

?- exists(person(X, fox, _, _)).
X = tom ;
X = ann ;
X = pat ;
X = jim ;
X = amy .

?- exists(person(FirstName, LastName, born(_, _, 1972), _)).
FirstName = susan,
LastName = rothchild .

?- exists(person(FirstName, LastName, _, unemployed)).
FirstName = pat,
LastName = fox ;
FirstName = jim,
LastName = fox ;
FirstName = amy,
LastName = fox ;
FirstName = ace,
LastName = rothchild.
#+END_SRC

Let's get a little more sophisticated. Here is an interesting query:

#+BEGIN_SRC prolog
% Find all people born after 1980 who do not work at OSU

?- exists(person(FirstName, LastName, born(_, _, Year), Job)),
      Year > 1980, Job \= osu.

FirstName = pat,
LastName = fox,
Year = 1983,
Job = unemployed ;
FirstName = jim,
LastName = fox,
Year = 1986,
Job = unemployed ;
FirstName = amy,
LastName = fox,
Year = 1990,
Job = unemployed ;
FirstName = ace,
LastName = rothchild,
Year = 2010,
Job = unemployed.
#+END_SRC

Let's add a ~householdSize~ predicate. It "counts" the number of
children and adds 2 (for the parents):

#+BEGIN_SRC prolog
householdSize(ID, Size) :-
    family(ID, _, _, Children),
    length(Children, ChildrenCount),
    Size is 2 + ChildrenCount.
#+END_SRC prolog

E.g.,

#+BEGIN_SRC prolog
?- householdSize(38463, Size).
Size = 3.

?- householdSize(X, 5).
X = 10392 .

?- householdSize(X, Size), Size > 3.
X = 10392,
Size = 5 .
#+END_SRC

We can use an interesting built-in predicate, ~findall~, that finds a
list of objects that match some "goal." Here is its use in a query:

#+BEGIN_SRC prolog
% First part of findall is what to collect,
% second part is the "goal" (a predicate),
% third part is the name of the resulting list
?- findall(FirstName, exists(person(FirstName, _, _, _)), Result).
Result = [tom, susan, ann, jess, pat, jim, amy, ace].
#+END_SRC

Of course, we can count the list:

#+BEGIN_SRC prolog
?- findall(FirstName, exists(person(FirstName, _, _, _)), Result),
       length(Result, N).
Result = [tom, susan, ann, jess, pat, jim, amy, ace],
N = 8.
#+END_SRC

If we get a list of numbers, we can sum or average them. We'll need to
load a Prolog library, however. Here is some code in a database file:

#+BEGIN_SRC prolog
:- use_module(library(lists)). % load lists library for sumlist predicate

average(List, Avg) :-
    sumlist(List, Sum),
    length(List, N),
    Avg is Sum / N.
#+END_SRC

Here is a use:

#+BEGIN_SRC prolog
?- average([1, 3, 4.2, 4.5], Avg).
Avg = 3.175.
#+END_SRC

Ok, now let's grab household incomes and average them. In query mode:

#+BEGIN_SRC prolog
?- findall(Income, householdIncome(_, Income), Result), average(Result, Avg).
Result = [217000, 198500],
Avg = 207750.
#+END_SRC

#+INCLUDE: footer.org
