prolog.html

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Prolog for databases</h2>
<div class="outline-text-2" id="text-5">


<p>
Now we&rsquo;ll investigate using Prolog for representing and answering
queries about data. Let&rsquo;s build a database of people and families. We
want to say that certain people are born on certain dates, have jobs
with particular incomes, are married, have children, etc.
</p>
<p>
We&rsquo;ll start with a predicate, <code>family</code>, that says a family is made up
of an ID (a number), two parents, and zero-or-more children (a
list). Each person has a first name and last name, birth date, and is
either unemployed or has a job with a particular salary.
</p>



<pre class="src src-prolog"><span style="color: #0000ff;">family</span>(10392,
       person(tom, fox, born(7, may, 1960), works(cnn, 152000)),
       person(ann, fox, born(19, april, 1961), works(nyu, 65000)),
       <span style="color: #b22222;">% here are the children...</span>
       <span style="color: #a020f0;">[</span>person(pat, fox, born(5, october, 1983), unemployed),
        person(jim, fox, born(1, june, 1986), unemployed),
        person(amy, fox, born(17, december, 1990), unemployed)<span style="color: #a020f0;">]</span>).

<span style="color: #0000ff;">family</span>(38463, 
       person(susan, rothchild, born(13, september, 1972), works(osu, 75000)),
       person(jess, rothchild, born(20, july, 1975), works(nationwide, 123500)),
       <span style="color: #b22222;">% here are the children...</span>
       <span style="color: #a020f0;">[</span>person(ace, rothchild, born(2, january, 2010), unemployed)<span style="color: #a020f0;">]</span>).
</pre>


<p>
There are two families. Note that <code>person</code> is not a predicate, it&rsquo;s
just a way of writing data. We have no way of asking <code>person(X, Y, ...)</code> because it&rsquo;s not a predicate. To access person data, we have to
use the <code>family</code> predicate. Here are some examples:
</p>



<pre class="src src-prolog">?- family(38463, <span style="color: #a0522d;">X</span>, <span style="color: #a0522d;">Y</span>, <span style="color: #a0522d;">Z</span>).
<span style="color: #a0522d;">X</span> = person(susan, rothchild, born(13, september, 1972), works(osu, 75000)),
<span style="color: #a0522d;">Y</span> = person(jess, rothchild, born(20, july, 1975), works(nationwide, 123500)),
<span style="color: #a0522d;">Z</span> = <span style="color: #a020f0;">[</span>person(ace, rothchild, born(2, january, 2010), unemployed)<span style="color: #a020f0;">]</span>.

?- family(38463, person(<span style="color: #a0522d;">FirstName</span>, <span style="color: #a0522d;">LastName</span>, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>), <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>).
<span style="color: #a0522d;">FirstName</span> = susan,
<span style="color: #a0522d;">LastName</span> = rothchild.

?- family(<span style="color: #a0522d;">ID</span>, person(susan, rothchild, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>), <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>).
<span style="color: #a0522d;">ID</span> = 38463.
</pre>


<p>
Using this <code>family</code> predicate, we just put a variable in a location
that we want to retrieve information about (such as family ID or a
first name / last name of a person), and put <code>_</code> for all the slots we
don&rsquo;t care about.
</p>
<p>
Now let&rsquo;s make it a little more interesting. Here is a <code>married</code>
predicate that says if two people are married:
</p>



<pre class="src src-prolog"><span style="color: #0000ff;">married</span>(<span style="color: #a0522d;">FirstName1</span>, <span style="color: #a0522d;">LastName1</span>, <span style="color: #a0522d;">FirstName2</span>, <span style="color: #a0522d;">LastName2</span>) :-
    family(<span style="color: #a0522d;">_</span>, person(<span style="color: #a0522d;">FirstName1</span>, <span style="color: #a0522d;">LastName1</span>, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>),
           person(<span style="color: #a0522d;">FirstName2</span>, <span style="color: #a0522d;">LastName2</span>, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>), <span style="color: #a0522d;">_</span>).

<span style="color: #0000ff;">married</span>(<span style="color: #a0522d;">FirstName1</span>, <span style="color: #a0522d;">LastName1</span>, <span style="color: #a0522d;">FirstName2</span>, <span style="color: #a0522d;">LastName2</span>) :-
    family(<span style="color: #a0522d;">_</span>, person(<span style="color: #a0522d;">FirstName2</span>, <span style="color: #a0522d;">LastName2</span>, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>),
           person(<span style="color: #a0522d;">FirstName1</span>, <span style="color: #a0522d;">LastName1</span>, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>), <span style="color: #a0522d;">_</span>).
</pre>


<p>
And its use:
</p>



<pre class="src src-prolog">?- married(tom, fox, ann, fox).
true .

?- married(<span style="color: #a0522d;">X</span>, <span style="color: #a0522d;">Y</span>, ann, fox).
<span style="color: #a0522d;">X</span> = tom,
<span style="color: #a0522d;">Y</span> = fox .

?- married(<span style="color: #a0522d;">X</span>, <span style="color: #a0522d;">Y</span>, <span style="color: #a0522d;">A</span>, <span style="color: #a0522d;">B</span>).
<span style="color: #a0522d;">X</span> = tom,
<span style="color: #a0522d;">Y</span> = fox,
<span style="color: #a0522d;">A</span> = ann,
<span style="color: #a0522d;">B</span> = fox <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = susan,
<span style="color: #a0522d;">Y</span> = rothchild,
<span style="color: #a0522d;">A</span> = jess,
<span style="color: #a0522d;">B</span> = rothchild .
</pre>


<p>
Here is a predicate for calculating household income. We can calculate
(simple math) using the <code>is</code> keyword:
</p>



<pre class="src src-prolog"><span style="color: #0000ff;">householdIncome</span>(<span style="color: #a0522d;">ID</span>, <span style="color: #a0522d;">Income</span>) :-
    family(<span style="color: #a0522d;">ID</span>, person(<span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>, works(<span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">Income1</span>)),
           person(<span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>, works(<span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">Income2</span>)), <span style="color: #a0522d;">_</span>),
    <span style="color: #a0522d;">Income</span> is <span style="color: #a0522d;">Income1</span> + <span style="color: #a0522d;">Income2</span>.
</pre>


<p>
And its use:
</p>



<pre class="src src-prolog">?- householdIncome(38463, <span style="color: #a0522d;">X</span>).
<span style="color: #a0522d;">X</span> = 198500.

?- householdIncome(<span style="color: #a0522d;">X</span>, 198500).
<span style="color: #a0522d;">X</span> = 38463.

?- householdIncome(<span style="color: #a0522d;">X</span>, 999).
false.

?- householdIncome(<span style="color: #a0522d;">X</span>, <span style="color: #a0522d;">Y</span>).
<span style="color: #a0522d;">X</span> = 10392,
<span style="color: #a0522d;">Y</span> = 217000 <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = 38463,
<span style="color: #a0522d;">Y</span> = 198500.
</pre>


<p>
To facilitate further queries, we&rsquo;ll create an <code>exists</code> predicate that
we can use to retrieve details about a person. It just pulls person
information out of the various places it may appear in a <code>family</code>
fact.
</p>



<pre class="src src-prolog"><span style="color: #0000ff;">exists</span>(<span style="color: #a0522d;">Person</span>) :- family(<span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">Person</span>, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>).
<span style="color: #0000ff;">exists</span>(<span style="color: #a0522d;">Person</span>) :- family(<span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">Person</span>, <span style="color: #a0522d;">_</span>).
<span style="color: #0000ff;">exists</span>(<span style="color: #a0522d;">Person</span>) :- family(<span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">Children</span>), member(<span style="color: #a0522d;">Person</span>, <span style="color: #a0522d;">Children</span>).
</pre>


<p>
We can use it like so:
</p>



<pre class="src src-prolog">?- exists(<span style="color: #a0522d;">X</span>).
<span style="color: #a0522d;">X</span> = person(tom, fox, born(7, may, 1960), works(cnn, 152000)) <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = person(susan, rothchild, born(13, september, 1972), works(osu, 75000)) <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = person(ann, fox, born(19, april, 1961), works(nyu, 65000)) <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = person(jess, rothchild, born(20, july, 1975), works(nationwide, 123500)) <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = person(pat, fox, born(5, october, 1983), unemployed) <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = person(jim, fox, born(1, june, 1986), unemployed) <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = person(amy, fox, born(17, december, 1990), unemployed) <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = person(ace, rothchild, born(2, january, 2010), unemployed).

?- exists(person(<span style="color: #a0522d;">X</span>, fox, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>)).
<span style="color: #a0522d;">X</span> = tom <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = ann <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = pat <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = jim <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">X</span> = amy .

?- exists(person(<span style="color: #a0522d;">FirstName</span>, <span style="color: #a0522d;">LastName</span>, born(<span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>, 1972), <span style="color: #a0522d;">_</span>)).
<span style="color: #a0522d;">FirstName</span> = susan,
<span style="color: #a0522d;">LastName</span> = rothchild .

?- exists(person(<span style="color: #a0522d;">FirstName</span>, <span style="color: #a0522d;">LastName</span>, <span style="color: #a0522d;">_</span>, unemployed)).
<span style="color: #a0522d;">FirstName</span> = pat,
<span style="color: #a0522d;">LastName</span> = fox <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">FirstName</span> = jim,
<span style="color: #a0522d;">LastName</span> = fox <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">FirstName</span> = amy,
<span style="color: #a0522d;">LastName</span> = fox <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">FirstName</span> = ace,
<span style="color: #a0522d;">LastName</span> = rothchild.
</pre>


<p>
Let&rsquo;s get a little more sophisticated. Here is an interesting query:
</p>



<pre class="src src-prolog"><span style="color: #b22222;">% </span><span style="color: #b22222;">Find all people born after 1980 who do not work at OSU</span>

?- exists(person(<span style="color: #a0522d;">FirstName</span>, <span style="color: #a0522d;">LastName</span>, born(<span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">Year</span>), <span style="color: #a0522d;">Job</span>)),
      <span style="color: #a0522d;">Year</span> &gt; 1980, <span style="color: #a0522d;">Job</span> \= osu.

<span style="color: #a0522d;">FirstName</span> = pat,
<span style="color: #a0522d;">LastName</span> = fox,
<span style="color: #a0522d;">Year</span> = 1983,
<span style="color: #a0522d;">Job</span> = unemployed <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">FirstName</span> = jim,
<span style="color: #a0522d;">LastName</span> = fox,
<span style="color: #a0522d;">Year</span> = 1986,
<span style="color: #a0522d;">Job</span> = unemployed <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">FirstName</span> = amy,
<span style="color: #a0522d;">LastName</span> = fox,
<span style="color: #a0522d;">Year</span> = 1990,
<span style="color: #a0522d;">Job</span> = unemployed <span style="color: #a020f0;">;</span>
<span style="color: #a0522d;">FirstName</span> = ace,
<span style="color: #a0522d;">LastName</span> = rothchild,
<span style="color: #a0522d;">Year</span> = 2010,
<span style="color: #a0522d;">Job</span> = unemployed.
</pre>


<p>
Let&rsquo;s add a <code>householdSize</code> predicate. It &ldquo;counts&rdquo; the number of
children and adds 2 (for the parents):
</p>



<pre class="src src-prolog"><span style="color: #0000ff;">householdSize</span>(<span style="color: #a0522d;">ID</span>, <span style="color: #a0522d;">Size</span>) :-
    family(<span style="color: #a0522d;">ID</span>, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">Children</span>),
    length(<span style="color: #a0522d;">Children</span>, <span style="color: #a0522d;">ChildrenCount</span>),
    <span style="color: #a0522d;">Size</span> is 2 + <span style="color: #a0522d;">ChildrenCount</span>.
</pre>


<p>
E.g.,
</p>



<pre class="src src-prolog">?- householdSize(38463, <span style="color: #a0522d;">Size</span>).
<span style="color: #a0522d;">Size</span> = 3.

?- householdSize(<span style="color: #a0522d;">X</span>, 5).
<span style="color: #a0522d;">X</span> = 10392 .

?- householdSize(<span style="color: #a0522d;">X</span>, <span style="color: #a0522d;">Size</span>), <span style="color: #a0522d;">Size</span> &gt; 3.
<span style="color: #a0522d;">X</span> = 10392,
<span style="color: #a0522d;">Size</span> = 5 .
</pre>


<p>
We can use an interesting built-in predicate, <code>findall</code>, that finds a
list of objects that match some &ldquo;goal.&rdquo; Here is its use in a query:
</p>



<pre class="src src-prolog"><span style="color: #b22222;">% </span><span style="color: #b22222;">First part of findall is what to collect,</span>
<span style="color: #b22222;">% </span><span style="color: #b22222;">second part is the </span><span style="color: #b22222;">"goal"</span><span style="color: #b22222;"> (a predicate),</span>
<span style="color: #b22222;">% </span><span style="color: #b22222;">third part is the name of the resulting list</span>
?- findall(<span style="color: #a0522d;">FirstName</span>, exists(person(<span style="color: #a0522d;">FirstName</span>, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>)), <span style="color: #a0522d;">Result</span>).
<span style="color: #a0522d;">Result</span> = <span style="color: #a020f0;">[</span>tom, susan, ann, jess, pat, jim, amy, ace<span style="color: #a020f0;">]</span>.
</pre>


<p>
Of course, we can count the list:
</p>



<pre class="src src-prolog">?- findall(<span style="color: #a0522d;">FirstName</span>, exists(person(<span style="color: #a0522d;">FirstName</span>, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">_</span>)), <span style="color: #a0522d;">Result</span>),
       length(<span style="color: #a0522d;">Result</span>, <span style="color: #a0522d;">N</span>).
<span style="color: #a0522d;">Result</span> = <span style="color: #a020f0;">[</span>tom, susan, ann, jess, pat, jim, amy, ace<span style="color: #a020f0;">]</span>,
<span style="color: #a0522d;">N</span> = 8.
</pre>


<p>
If we get a list of numbers, we can sum or average them. We&rsquo;ll need to
load a Prolog library, however. Here is some code in a database file:
</p>



<pre class="src src-prolog">:- <span style="color: #483d8b;">use_module</span>(library(lists)). <span style="color: #b22222;">% load lists library for sumlist predicate</span>

<span style="color: #0000ff;">average</span>(<span style="color: #a0522d;">List</span>, <span style="color: #a0522d;">Avg</span>) :-
    sumlist(<span style="color: #a0522d;">List</span>, <span style="color: #a0522d;">Sum</span>),
    length(<span style="color: #a0522d;">List</span>, <span style="color: #a0522d;">N</span>),
    <span style="color: #a0522d;">Avg</span> is <span style="color: #a0522d;">Sum</span> / <span style="color: #a0522d;">N</span>.
</pre>


<p>
Here is a use:
</p>



<pre class="src src-prolog">?- average(<span style="color: #a020f0;">[</span>1, 3, 4.2, 4.5<span style="color: #a020f0;">]</span>, <span style="color: #a0522d;">Avg</span>).
<span style="color: #a0522d;">Avg</span> = 3.175.
</pre>


<p>
Ok, now let&rsquo;s grab household incomes and average them. In query mode:
</p>



<pre class="src src-prolog">?- findall(<span style="color: #a0522d;">Income</span>, householdIncome(<span style="color: #a0522d;">_</span>, <span style="color: #a0522d;">Income</span>), <span style="color: #a0522d;">Result</span>), average(<span style="color: #a0522d;">Result</span>, <span style="color: #a0522d;">Avg</span>).
<span style="color: #a0522d;">Result</span> = <span style="color: #a020f0;">[</span>217000, 198500<span style="color: #a020f0;">]</span>,
<span style="color: #a0522d;">Avg</span> = 207750.
</pre>


<div style="font-size: 80%; clear: both;">
<span xmlns:dct="http://purl.org/dc/terms/" href="http://purl.org/dc/dcmitype/Text" property="dct:title" rel="dct:type">CSE 3521 material</span> by <a xmlns:cc="http://creativecommons.org/ns#" href="http://cse3521.artifice.cc" property="cc:attributionName" rel="cc:attributionURL">Joshua Eckroth</a> is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-sa/3.0/">Creative Commons Attribution-ShareAlike 3.0 Unported License</a>. Source code for this website available at <a href="https://github.com/joshuaeckroth/cse3521-website">GitHub</a>.
</div>

<!-- Plupper Tracking Code -->
<script src="https://www.google.com/jsapi"></script>
<script type="text/javascript"
    src="https://static.plupper.com/js/plupper.js"></script>
<script type="text/javascript">
    plupper.init("joshuaeckroth@plupper.com");
    plupper.enableCobrowsing();
</script>
<!-- End of Plupper Tracking Code -->


</div>
</div>
</div>

</body>
</html>
